m1seryx/HAGOKILLER/firmware/esp32_s3_inmp441/esp32_s3_inmp441.ino
/*
 * HAGOKILLER - ESP32-S3 + INMP441 + Edge Impulse
 * - BLE server for phone app (name: HAGOKILLER Pillow)
 * - ESP-NOW sender to air-pump ESP32
 * - LED flashes 2 times when the app connects, then IoT (mic + ML) starts
 *
 * INMP441:
 *   VDD -> 3.3V
 *   GND -> GND
 *   SD  -> GPIO 6
 *   SCK -> GPIO 5
 *   WS  -> GPIO 4
 *   L/R -> GND
 *
 * Phone pair PIN (demo): 1234567
 * Upload pump (ESP-NOW) first, then this mic board.
 * Serial: 115200
 *
 * Color coding after IoT starts:
 *   WHITE = no sound  (ML is NOT run)
 *   RED   = sound heard, not snoring
 *   BLUE  = snoring
 *
 * ML decision: snore wins only if score >= 60% and higher than non-snore.
 * Counting: min 5s between counted snores; mute during pump/valve + settle.
 *
 * Pillow cycle (with air-pump ESP):
 *   3 snores -> full inflate -> elevated
 *   still snore elevated -> top-up 2s -> after 1 min solenoid 3s
 *   still snore -> gradual short valve pulses (pump board)
 *   quiet elevated -> 10 min hold -> solenoid 10s full deflate
 *
 * Phone settings (BLE): snore count, window seconds, pump seconds, mic shift.
 * Phone commands (BLE): manual stop pump, open solenoid valve.
 */

#include <Arduino.h>
#include <driver/i2s.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>
#include <WiFi.h>
#include <esp_wifi.h>
#include <esp_now.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <azeem01nnie-project-1_inferencing.h>
#include "esp32-hal-rgb-led.h"

#define I2S_WS     4
#define I2S_SCK    5
#define I2S_SD     6
#define I2S_PORT   I2S_NUM_0
#define SAMPLE_RATE 16000

#if defined(RGB_BUILTIN)
  #define RGB_LED_PIN RGB_BUILTIN
#else
  #define RGB_LED_PIN 48
#endif

#define MIC_SHIFT_DEFAULT 15
#define CALIBRATE_N 20
#define RMS_RATIO 1.60f
#define RMS_MARGIN 200.0f
#define PEAK_RATIO 1.70f
#define PEAK_MARGIN 500
#define LOUD_STREAK_NEED 2
#define PUMP_SEC_MIN 5
#define PUMP_SEC_MAX 120
#define PUMP_SEC_DEFAULT 12
#define SNORE_WINDOW_DEFAULT 15
#define SNORE_WINDOW_MIN 5
#define SNORE_WINDOW_MAX 60
#define SNORE_TIMES_MAX 10
/** Min gap between counted snore events (stops one long snore = 2–3 counts). */
#define SNORE_MIN_GAP_MS 5000UL
/** Extra quiet time after pump finishes before counting snores again. */
#define POST_PUMP_MUTE_MS 8000UL
/** Require clearer snore confidence than plain 50/50. */
#define SNORE_MIN_SCORE 0.60f
#define VALVE_SEC_DEFAULT 10
#define TOPUP_SEC 2
#define TOPUP_SEND_COOLDOWN_MS 90000UL
#define QUIET_CONFIRM_MS 30000UL
#define QUIET_HOLD_MS (10UL * 60UL * 1000UL)
#define SEND_COOLDOWN_MS 2000
#define ESPNOW_CHANNEL 1
#define HEARTBEAT_MS 3000
#define EI_SAMPLE_COUNT EI_CLASSIFIER_RAW_SAMPLE_COUNT

#define DEVICE_NAME "HAGOKILLER Pillow"
#define PAIR_PIN    "1234567"

#define PHONE_SERVICE_UUID "6ba1d001-8e2a-4b7c-9f10-22c0a1b2c3d4"
#define PIN_CHAR_UUID      "6ba1d002-8e2a-4b7c-9f10-22c0a1b2c3d4"
#define AUTH_CHAR_UUID     "6ba1d003-8e2a-4b7c-9f10-22c0a1b2c3d4"
#define EVENT_CHAR_UUID    "6ba1d004-8e2a-4b7c-9f10-22c0a1b2c3d4"
#define SETTINGS_CHAR_UUID "6ba1d005-8e2a-4b7c-9f10-22c0a1b2c3d4"

static int16_t audio_buffer[EI_SAMPLE_COUNT];
bool i2sReady = false;
bool iotStarted = false;
volatile bool phoneConnected = false;
volatile bool pendingConnectFlash = false;
bool phoneAuthenticated = false;
unsigned long lastSendMs = 0;
unsigned long lastBleStatusMs = 0;
unsigned long lastHeartbeatMs = 0;
unsigned long pumpLockUntilMs = 0;
float noiseRms = 120.0f;
int noisePeak = 300;
uint8_t micShift = MIC_SHIFT_DEFAULT;
uint8_t snoreThreshold = 3;
uint8_t snoreWindowSec = SNORE_WINDOW_DEFAULT;
uint8_t pumpSeconds = PUMP_SEC_DEFAULT;
uint8_t snoreStreak = 0;
uint8_t loudStreak = 0;
bool pendingRecalibrate = false;
unsigned long snoreTimes[SNORE_TIMES_MAX];
uint8_t snoreTimeCount = 0;
unsigned long lastCountedSnoreMs = 0;
unsigned long listenMuteUntilMs = 0;
bool pillowElevated = false;
unsigned long quietSinceMs = 0;
unsigned long lastTopupSendMs = 0;

BLECharacteristic *authChar = nullptr;
BLECharacteristic *eventChar = nullptr;
BLEServer *bleServer = nullptr;

typedef struct __attribute__((packed)) {
  uint32_t magic;
  uint8_t  event;
  uint8_t  level;
  uint16_t rms;
  uint8_t  pumpSeconds;
  uint8_t  streak;
  uint8_t  flags;
  uint8_t  reserved;
} PumpMsg;

typedef struct __attribute__((packed)) {
  uint32_t magic;
  uint8_t  snoreThreshold;
  uint8_t  pumpSeconds;
  uint8_t  micShift;
  uint8_t  snoreWindowSec;
} SettingsMsg;

typedef struct __attribute__((packed)) {
  uint32_t magic;
  uint8_t  opcode;
  uint8_t  argSeconds;
  uint8_t  reserved0;
  uint8_t  reserved1;
} CommandMsg;

static const uint32_t MSG_MAGIC = 0x48474F4B;
static const uint32_t SETTINGS_MAGIC = 0x48475354;
static const uint32_t COMMAND_MAGIC = 0x4847434D;
static const uint8_t EVENT_SOUND = 1;
static const uint8_t EVENT_HEARTBEAT = 2;
static const uint8_t EVENT_STOP = 3;
static const uint8_t EVENT_OPEN_VALVE = 4;
static const uint8_t EVENT_SNORE_ACTIVE = 5;
static const uint8_t FLAG_INTERVENTION = 0x01;
static const uint8_t CMD_STOP = 1;
static const uint8_t CMD_OPEN_VALVE = 2;
uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

void setRgb(uint8_t r, uint8_t g, uint8_t b)
{
    neopixelWrite(RGB_LED_PIN, r, g, b);
}

void ledWhiteNoSound() { setRgb(255, 255, 255); }
void ledRedNonSnoring() { setRgb(255, 0, 0); }
void ledBlueSnoring() { setRgb(0, 0, 255); }

void flashBluetoothConnected()
{
    for (int i = 0; i < 2; i++) {
        setRgb(0, 180, 255);
        delay(180);
        setRgb(0, 0, 0);
        delay(180);
    }
}

void setAuth(bool ok)
{
    phoneAuthenticated = ok;
    if (authChar) {
        uint8_t v = ok ? 1 : 0;
        authChar->setValue(&v, 1);
        authChar->notify();
    }
    if (ok) {
        Serial.println("BLE: PIN ok - app paired with ESP32");
    } else {
        Serial.println("BLE: PIN cleared");
    }
    Serial.flush();
}

class PhoneServerCallbacks : public BLEServerCallbacks {
    void onConnect(BLEServer *pServer) override {
        phoneConnected = true;
        pendingConnectFlash = true;
        Serial.println("BLE: app connected to ESP32");
        Serial.println("BLE: waiting for 7-digit PIN...");
        Serial.flush();
    }

    void onDisconnect(BLEServer *pServer) override {
        phoneConnected = false;
        iotStarted = false;
        setAuth(false);
        Serial.println("BLE: app disconnected");
        pServer->startAdvertising();
        Serial.println("BLE: waiting for app...");
        Serial.flush();
        setRgb(0, 0, 40);
    }
};

class PinCallbacks : public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic *pCharacteristic) override {
        String pin = pCharacteristic->getValue();
        pin.trim();
        Serial.print("BLE: PIN from app: ");
        Serial.println(pin);
        Serial.flush();

        if (pin == PAIR_PIN) {
            setAuth(true);
        } else {
            setAuth(false);
            Serial.println("BLE: bad PIN - not paired");
            Serial.flush();
        }
    }
};

