m1seryx/HAGOKILLER/firmware/esp32_s3_inmp441/esp32_s3_inmp441.ino
uint8_t clampU8(uint8_t v, uint8_t lo, uint8_t hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

void clearSnoreWindow()
{
    snoreTimeCount = 0;
    snoreStreak = 0;
}

void clearElevatedState()
{
    pillowElevated = false;
    quietSinceMs = 0;
    lastTopupSendMs = 0;
}

void armActuatorMute(unsigned long now, unsigned long actuatorMs)
{
    unsigned long until = now + actuatorMs + POST_PUMP_MUTE_MS;
    if ((long)(until - listenMuteUntilMs) > 0) listenMuteUntilMs = until;
    clearSnoreWindow();
}

void armPostPumpMute(unsigned long now)
{
    armActuatorMute(now, (unsigned long)pumpSeconds * 1000UL);
}

bool snoreListenMuted(unsigned long now)
{
    if ((long)(now - listenMuteUntilMs) < 0) return true;
    if ((long)(now - pumpLockUntilMs) < 0) return true;
    return false;
}

uint8_t refreshSnoreWindow(unsigned long now)
{
    unsigned long windowMs = (unsigned long)snoreWindowSec * 1000UL;
    uint8_t kept = 0;
    for (uint8_t i = 0; i < snoreTimeCount; i++) {
        if ((long)(now - snoreTimes[i]) <= (long)windowMs) {
            snoreTimes[kept++] = snoreTimes[i];
        }
    }
    snoreTimeCount = kept;
    snoreStreak = snoreTimeCount;
    return snoreStreak;
}

/**
 * Count a snore only if enough time passed since the last counted one.
 * Returns 0xFF if ignored (gap / mute), else current streak.
 */
uint8_t noteSnoreEvent(unsigned long now)
{
    if (snoreListenMuted(now)) {
        return 0xFF;
    }
    if (lastCountedSnoreMs != 0 && (now - lastCountedSnoreMs) < SNORE_MIN_GAP_MS) {
        return 0xFE;
    }

    refreshSnoreWindow(now);
    if (snoreTimeCount < SNORE_TIMES_MAX) {
        snoreTimes[snoreTimeCount++] = now;
    } else {
        for (uint8_t i = 1; i < SNORE_TIMES_MAX; i++) snoreTimes[i - 1] = snoreTimes[i];
        snoreTimes[SNORE_TIMES_MAX - 1] = now;
    }
    lastCountedSnoreMs = now;
    snoreStreak = snoreTimeCount;
    return snoreStreak;
}

void printDeviceSettings()
{
    Serial.print("Settings: snores=");
    Serial.print(snoreThreshold);
    Serial.print(" in ");
    Serial.print(snoreWindowSec);
    Serial.print("s  pump=");
    Serial.print(pumpSeconds);
    Serial.print(" sec  micShift=");
    Serial.println(micShift);
    Serial.flush();
}

void sendPumpControlEvent(uint8_t eventCode, uint8_t seconds)
{
    PumpMsg msg;
    memset(&msg, 0, sizeof(msg));
    msg.magic = MSG_MAGIC;
    msg.event = eventCode;
    msg.pumpSeconds = seconds;
    msg.streak = snoreStreak;
    esp_now_send(broadcastAddress, (uint8_t *)&msg, sizeof(msg));
}

void applyCommandPacket(const uint8_t *data, size_t len)
{
    if (len < sizeof(CommandMsg)) {
        Serial.println("BLE: command packet too short");
        return;
    }

    CommandMsg msg;
    memcpy(&msg, data, sizeof(msg));
    if (msg.magic != COMMAND_MAGIC) {
        Serial.println("BLE: bad command magic");
        return;
    }

    if (msg.opcode == CMD_STOP) {
        clearSnoreWindow();
        clearElevatedState();
        pumpLockUntilMs = 0;
        listenMuteUntilMs = 0;
        sendPumpControlEvent(EVENT_STOP, 0);
        Serial.println("BLE: manual STOP -> pump ESP");
        return;
    }

    if (msg.opcode == CMD_OPEN_VALVE) {
        uint8_t secs = msg.argSeconds == 0 ? VALVE_SEC_DEFAULT : clampU8(msg.argSeconds, 1, 30);
        // Stop inflation first, then open valve.
        sendPumpControlEvent(EVENT_STOP, 0);
        delay(30);
        sendPumpControlEvent(EVENT_OPEN_VALVE, secs);
        clearElevatedState();
        armActuatorMute(millis(), (unsigned long)secs * 1000UL);
        Serial.print("BLE: OPEN VALVE -> pump ESP  ");
        Serial.print(secs);
        Serial.println(" sec");
        return;
    }

    Serial.print("BLE: unknown command opcode ");
    Serial.println(msg.opcode);
}

void applySettingsPacket(const uint8_t *data, size_t len)
{
    if (len < sizeof(SettingsMsg)) {
        Serial.println("BLE: settings packet too short");
        return;
    }

    SettingsMsg msg;
    memcpy(&msg, data, sizeof(msg));
    if (msg.magic != SETTINGS_MAGIC) {
        Serial.println("BLE: bad settings magic");
        return;
    }

    uint8_t nextShift = clampU8(msg.micShift, 12, 16);
    bool shiftChanged = nextShift != micShift;
    snoreThreshold = clampU8(msg.snoreThreshold, 1, 10);
    pumpSeconds = clampU8(msg.pumpSeconds, PUMP_SEC_MIN, PUMP_SEC_MAX);
    micShift = nextShift;
    snoreWindowSec = clampU8(
        msg.snoreWindowSec == 0 ? SNORE_WINDOW_DEFAULT : msg.snoreWindowSec,
        SNORE_WINDOW_MIN,
        SNORE_WINDOW_MAX
    );
    clearSnoreWindow();
    clearElevatedState();
    pumpLockUntilMs = 0;
    if (shiftChanged && iotStarted && i2sReady) pendingRecalibrate = true;

    Serial.println("BLE: settings applied from app");
    printDeviceSettings();
}

class SettingsCallbacks : public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic *pCharacteristic) override {
        String raw = pCharacteristic->getValue();
        const uint8_t *bytes = (const uint8_t *)raw.c_str();
        size_t len = raw.length();
        if (len < 4) {
            Serial.println("BLE: write too short");
            return;
        }

        uint32_t magic = (uint32_t)bytes[0]
            | ((uint32_t)bytes[1] << 8)
            | ((uint32_t)bytes[2] << 16)
            | ((uint32_t)bytes[3] << 24);

        if (magic == COMMAND_MAGIC) {
            applyCommandPacket(bytes, len);
        } else if (magic == SETTINGS_MAGIC) {
            applySettingsPacket(bytes, len);
        } else {
            Serial.println("BLE: unknown write magic");
        }
    }
};

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void onEspNowSent(const wifi_tx_info_t *info, esp_now_send_status_t status) {
#else
void onEspNowSent(const uint8_t *mac, esp_now_send_status_t status) {
#endif
    if (status != ESP_NOW_SEND_SUCCESS) {
        Serial.println("ESP-NOW send FAIL");
    }
}

bool setupEspNow()
{
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    delay(50);
    esp_wifi_set_promiscuous(true);
    esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);
    esp_wifi_set_promiscuous(false);

