m1seryx/HAGOKILLER/firmware/esp32_s3_inmp441/esp32_s3_inmp441.ino
    if (esp_now_init() != ESP_OK) {
        Serial.println("ESP-NOW fail");
        return false;
    }

    esp_now_register_send_cb(onEspNowSent);

    esp_now_peer_info_t peer = {};
    memcpy(peer.peer_addr, broadcastAddress, 6);
    peer.channel = ESPNOW_CHANNEL;
    peer.encrypt = false;
    if (esp_now_is_peer_exist(broadcastAddress)) {
        esp_now_del_peer(broadcastAddress);
    }
    if (esp_now_add_peer(&peer) != ESP_OK) {
        Serial.println("ESP-NOW peer fail");
        return false;
    }

    Serial.print("ESP-NOW ready  ch=");
    Serial.print(ESPNOW_CHANNEL);
    Serial.print("  mic MAC=");
    Serial.println(WiFi.macAddress());
    return true;
}

void setupPhoneBle()
{
    BLEDevice::init(DEVICE_NAME);
    bleServer = BLEDevice::createServer();
    bleServer->setCallbacks(new PhoneServerCallbacks());

    BLEService *service = bleServer->createService(PHONE_SERVICE_UUID);

    BLECharacteristic *pinChar = service->createCharacteristic(
        PIN_CHAR_UUID,
        BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR
    );
    pinChar->setCallbacks(new PinCallbacks());

    authChar = service->createCharacteristic(
        AUTH_CHAR_UUID,
        BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_NOTIFY
    );
    authChar->addDescriptor(new BLE2902());
    uint8_t zero = 0;
    authChar->setValue(&zero, 1);

    eventChar = service->createCharacteristic(
        EVENT_CHAR_UUID,
        BLECharacteristic::PROPERTY_NOTIFY | BLECharacteristic::PROPERTY_READ
    );
    eventChar->addDescriptor(new BLE2902());

    BLECharacteristic *settingsChar = service->createCharacteristic(
        SETTINGS_CHAR_UUID,
        BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR
    );
    settingsChar->setCallbacks(new SettingsCallbacks());

    service->start();

    BLEAdvertising *adv = BLEDevice::getAdvertising();
    adv->addServiceUUID(PHONE_SERVICE_UUID);
    adv->setScanResponse(true);

    BLEAdvertisementData advData;
    advData.setName(DEVICE_NAME);
    advData.setCompleteServices(BLEUUID(PHONE_SERVICE_UUID));
    adv->setAdvertisementData(advData);

    BLEAdvertisementData scanData;
    scanData.setName(DEVICE_NAME);
    adv->setScanResponseData(scanData);

    adv->start();
    Serial.println("BLE: advertising as HAGOKILLER Pillow");
    Serial.println("BLE: waiting for app...");
    Serial.println("BLE: demo PIN 1234567");
    Serial.flush();
}

void fillPumpMsg(PumpMsg &msg, uint8_t level, uint16_t rms, uint8_t streak, bool intervene)
{
    msg.magic = MSG_MAGIC;
    msg.event = EVENT_SOUND;
    msg.level = level;
    msg.rms = rms;
    msg.pumpSeconds = pumpSeconds;
    msg.streak = streak;
    msg.flags = intervene ? FLAG_INTERVENTION : 0;
    msg.reserved = 0;
}

void fillPumpMsgSeconds(PumpMsg &msg, uint8_t level, uint16_t rms, uint8_t streak, uint8_t seconds)
{
    msg.magic = MSG_MAGIC;
    msg.event = EVENT_SOUND;
    msg.level = level;
    msg.rms = rms;
    msg.pumpSeconds = seconds;
    msg.streak = streak;
    msg.flags = FLAG_INTERVENTION;
    msg.reserved = 0;
}

void notifyPhone(uint8_t level, uint16_t rms, uint8_t streak, bool intervene)
{
    if (!phoneAuthenticated || eventChar == nullptr) return;

    PumpMsg msg;
    fillPumpMsg(msg, level, rms, streak, intervene);
    eventChar->setValue((uint8_t *)&msg, sizeof(msg));
    eventChar->notify();
    Serial.println("BLE notify -> phone");
}

bool pumpIsLocked(unsigned long now)
{
    return (long)(now - pumpLockUntilMs) < 0;
}

bool notifyPumpFull(uint8_t level, uint16_t rms, uint8_t streak)
{
    unsigned long now = millis();
    if (pumpIsLocked(now)) {
        unsigned long leftMs = pumpLockUntilMs - now;
        Serial.print("ESP-NOW -> pump skipped (still in pump lock, ");
        Serial.print((leftMs + 999UL) / 1000UL);
        Serial.println("s left)");
        return false;
    }
    if (now - lastSendMs < SEND_COOLDOWN_MS) {
        Serial.println("ESP-NOW -> pump skipped (send cooldown)");
        return false;
    }
    lastSendMs = now;

    PumpMsg msg;
    fillPumpMsgSeconds(msg, level, rms, streak, pumpSeconds);
    esp_now_send(broadcastAddress, (uint8_t *)&msg, sizeof(msg));
    pumpLockUntilMs = now + (unsigned long)pumpSeconds * 1000UL;
    Serial.print("ESP-NOW -> FULL pump  ");
    Serial.print(pumpSeconds);
    Serial.println(" sec");
    return true;
}

bool notifyPumpTopup(uint8_t level, uint16_t rms, uint8_t streak)
{
    unsigned long now = millis();
    if (pumpIsLocked(now)) {
        Serial.println("ESP-NOW -> top-up skipped (pump lock)");
        return false;
    }
    if (lastTopupSendMs != 0 && (now - lastTopupSendMs) < TOPUP_SEND_COOLDOWN_MS) {
        Serial.println("ESP-NOW -> top-up skipped (cooldown)");
        return false;
    }
    if (now - lastSendMs < SEND_COOLDOWN_MS) {
        Serial.println("ESP-NOW -> top-up skipped (send cooldown)");
        return false;
    }
    lastSendMs = now;
    lastTopupSendMs = now;

    PumpMsg msg;
    fillPumpMsgSeconds(msg, level, rms, streak, TOPUP_SEC);
    esp_now_send(broadcastAddress, (uint8_t *)&msg, sizeof(msg));
    pumpLockUntilMs = now + (unsigned long)TOPUP_SEC * 1000UL;
    Serial.print("ESP-NOW -> TOP-UP pump  ");
    Serial.print(TOPUP_SEC);
    Serial.println(" sec");
    return true;
}

void notifySnoreActive(uint8_t level, uint16_t rms, uint8_t streak)
{
    unsigned long now = millis();
    if (now - lastSendMs < SEND_COOLDOWN_MS) return;
    lastSendMs = now;

    PumpMsg msg;
    memset(&msg, 0, sizeof(msg));
    msg.magic = MSG_MAGIC;
    msg.event = EVENT_SNORE_ACTIVE;
    msg.level = level;
    msg.rms = rms;
    msg.streak = streak;
    esp_now_send(broadcastAddress, (uint8_t *)&msg, sizeof(msg));
    Serial.println("ESP-NOW -> snore-active (elevated)");
}

bool notifyPump(uint8_t level, uint16_t rms, uint8_t streak)
{
    return notifyPumpFull(level, rms, streak);
}

void markSnoringWhileElevated(unsigned long now)
{
    quietSinceMs = 0;
}

void updateElevatedQuietWatch(unsigned long now, bool heardSnore)
{
    if (!pillowElevated) return;

    if (heardSnore) {
        quietSinceMs = 0;
        return;
    }

