m1seryx/HAGOKILLER/firmware/esp32_s3_inmp441/esp32_s3_inmp441.ino
    // Only advance quiet when not muted (real quiet, not actuator mute).
    if (snoreListenMuted(now)) return;

    if (quietSinceMs == 0) {
        if (lastCountedSnoreMs != 0 && (now - lastCountedSnoreMs) >= QUIET_CONFIRM_MS) {
            quietSinceMs = now;
            Serial.println("elevated quiet confirmed — 10 min hold started");
        }
        return;
    }

    if ((now - quietSinceMs) >= QUIET_HOLD_MS) {
        Serial.println("elevated quiet 10 min — request full deflate 10s");
        sendPumpControlEvent(EVENT_OPEN_VALVE, VALVE_SEC_DEFAULT);
        armActuatorMute(now, (unsigned long)VALVE_SEC_DEFAULT * 1000UL);
        clearElevatedState();
        clearSnoreWindow();
    }
}

void sendMicHeartbeat()
{
    unsigned long now = millis();
    if (now - lastHeartbeatMs < HEARTBEAT_MS) return;
    lastHeartbeatMs = now;

    PumpMsg msg;
    memset(&msg, 0, sizeof(msg));
    msg.magic = MSG_MAGIC;
    msg.event = EVENT_HEARTBEAT;
    msg.pumpSeconds = pumpSeconds;
    msg.streak = snoreStreak;
    esp_now_send(broadcastAddress, (uint8_t *)&msg, sizeof(msg));
}

float computeRms(const int16_t *buffer, int count)
{
    if (count <= 0) return 0.0f;
    double sumSq = 0.0;
    for (int i = 0; i < count; i++) {
        double s = (double)buffer[i];
        sumSq += s * s;
    }
    return (float)sqrt(sumSq / (double)count);
}

int computePeak(const int16_t *buffer, int count)
{
    int peak = 0;
    for (int i = 0; i < count; i++) {
        int s = buffer[i];
        if (s == -32768) s = 32767;
        else if (s < 0) s = -s;
        if (s > peak) peak = s;
    }
    return peak;
}

bool labelIsSnoring(const char *label)
{
    if (!label) return false;
    String s = String(label);
    s.toLowerCase();
    if (s.indexOf("non") >= 0) return false;
    return s.indexOf("snor") >= 0;
}

bool setupI2S()
{
    i2s_config_t i2s_config = {
        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
        .sample_rate = SAMPLE_RATE,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_32BIT,
        .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT,
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = 8,
        .dma_buf_len = 256,
        .use_apll = false,
        .tx_desc_auto_clear = false,
        .fixed_mclk = 0
    };

    i2s_pin_config_t pin_config = {
        .bck_io_num = I2S_SCK,
        .ws_io_num = I2S_WS,
        .data_out_num = I2S_PIN_NO_CHANGE,
        .data_in_num = I2S_SD
    };

    if (i2s_driver_install(I2S_PORT, &i2s_config, 0, NULL) != ESP_OK) {
        Serial.println("ERROR: I2S driver install failed");
        setRgb(80, 0, 80);
        return false;
    }

    if (i2s_set_pin(I2S_PORT, &pin_config) != ESP_OK) {
        Serial.println("ERROR: I2S pin setup failed");
        setRgb(80, 0, 80);
        return false;
    }

    i2s_zero_dma_buffer(I2S_PORT);
    return true;
}

bool captureAudio()
{
    size_t bytesRead = 0;
    int32_t i2s_buffer[256];
    int samplesCollected = 0;

    while (samplesCollected < EI_SAMPLE_COUNT) {
        esp_err_t result = i2s_read(
            I2S_PORT,
            (void *)i2s_buffer,
            sizeof(i2s_buffer),
            &bytesRead,
            portMAX_DELAY
        );

        if (result != ESP_OK) {
            Serial.println("ERROR: I2S read failed");
            setRgb(80, 0, 80);
            return false;
        }

        int samplesRead = bytesRead / sizeof(int32_t);
        for (int i = 0; i < samplesRead && samplesCollected < EI_SAMPLE_COUNT; i++) {
            int32_t sample = i2s_buffer[i] >> micShift;
            if (sample > 32767) sample = 32767;
            if (sample < -32768) sample = -32768;
            audio_buffer[samplesCollected++] = (int16_t)sample;
        }
    }

    int32_t sum = 0;
    for (int i = 0; i < EI_SAMPLE_COUNT; i++) sum += audio_buffer[i];
    int16_t mean = (int16_t)(sum / EI_SAMPLE_COUNT);
    for (int i = 0; i < EI_SAMPLE_COUNT; i++) {
        int v = (int)audio_buffer[i] - (int)mean;
        if (v > 32767) v = 32767;
        if (v < -32768) v = -32768;
        audio_buffer[i] = (int16_t)v;
    }

    return true;
}

static int cmpFloat(const void *a, const void *b)
{
    float fa = *(const float *)a;
    float fb = *(const float *)b;
    return (fa > fb) - (fa < fb);
}

void calibrateNoiseFloor()
{
    Serial.println("Calibrating mic (keep the room quiet)...");
    Serial.flush();
    setRgb(0, 0, 80);

    float rmsList[CALIBRATE_N];
    int peakList[CALIBRATE_N];
    int okCount = 0;

    for (int i = 0; i < CALIBRATE_N; i++) {
        if (!captureAudio()) continue;
        rmsList[okCount] = computeRms(audio_buffer, EI_SAMPLE_COUNT);
        peakList[okCount] = computePeak(audio_buffer, EI_SAMPLE_COUNT);
        okCount++;
        delay(20);
    }

    if (okCount < 5) {
        noiseRms = 120.0f;
        noisePeak = 300;
    } else {
        qsort(rmsList, okCount, sizeof(float), cmpFloat);
        noiseRms = rmsList[okCount / 2];
        for (int i = 0; i < okCount; i++) {
            for (int j = i + 1; j < okCount; j++) {
                if (peakList[j] < peakList[i]) {
                    int t = peakList[i];
                    peakList[i] = peakList[j];
                    peakList[j] = t;
                }
            }
        }
        noisePeak = peakList[okCount / 2];
    }

    if (noiseRms < 80.0f) noiseRms = 80.0f;
    if (noisePeak < 160) noisePeak = 160;

    Serial.print("Noise floor RMS=");
    Serial.print(noiseRms, 1);
    Serial.print(" Peak=");
    Serial.println(noisePeak);
    Serial.flush();
}

bool isHearingSound(float rms, int peak)
{
    float rmsThresh = noiseRms * RMS_RATIO + RMS_MARGIN;
    int peakThresh = (int)(noisePeak * PEAK_RATIO) + PEAK_MARGIN;
    return (rms > rmsThresh) && (peak > peakThresh);
}

int get_signal_data(size_t offset, size_t length, float *out_ptr)
{
    for (size_t i = 0; i < length; i++) {
        out_ptr[i] = (float)audio_buffer[offset + i];
    }
    return 0;
}

float getSnoringScore(ei_impulse_result_t &result)
{
    float best = 0.0f;
    for (uint16_t i = 0; i < EI_CLASSIFIER_LABEL_COUNT; i++) {
        if (labelIsSnoring(ei_classifier_inferencing_categories[i])) {
            float v = result.classification[i].value;
            if (v > best) best = v;
        }
    }
    return best;
}

