m1seryx/HAGOKILLER/firmware/esp32_s3_inmp441/esp32_s3_inmp441.ino
float getNonSnoringScore(ei_impulse_result_t &result)
{
    float best = 0.0f;
    for (uint16_t i = 0; i < EI_CLASSIFIER_LABEL_COUNT; i++) {
        if (!labelIsSnoring(ei_classifier_inferencing_categories[i])) {
            float v = result.classification[i].value;
            if (v > best) best = v;
        }
    }
    return best;
}

bool isSnoringWinner(float snoringScore, float nonSnoringScore)
{
    // Need a clear snore majority — avoids weak 51/49 flips on pump/ambient noise.
    return snoringScore >= SNORE_MIN_SCORE && snoringScore > nonSnoringScore;
}

uint8_t snoreLevelFromScore(float snoringScore, float rms)
{
    int fromScore = (int)(snoringScore * 10.0f + 0.5f);
    int fromRms = 1;
    if (rms >= 2000) fromRms = 10;
    else if (rms >= 1500) fromRms = 8;
    else if (rms >= 1000) fromRms = 6;
    else if (rms >= 600) fromRms = 4;
    else if (rms >= 300) fromRms = 2;
    int level = fromScore > fromRms ? fromScore : fromRms;
    if (level < 1) level = 1;
    if (level > 10) level = 10;
    return (uint8_t)level;
}

void printResult(ei_impulse_result_t &result, float rms, int peak)
{
    Serial.println("========== ML RESULT ==========");
    for (uint16_t i = 0; i < EI_CLASSIFIER_LABEL_COUNT; i++) {
        Serial.print(ei_classifier_inferencing_categories[i]);
        Serial.print(": ");
        Serial.print(result.classification[i].value * 100.0f, 2);
        Serial.print("%");
        if (labelIsSnoring(ei_classifier_inferencing_categories[i])) {
            Serial.print("  <-- snoring class");
        }
        Serial.println();
    }

    float snoringScore = getSnoringScore(result);
    float nonSnoringScore = getNonSnoringScore(result);
    Serial.print("Snoring: ");
    Serial.print(snoringScore * 100.0f, 2);
    Serial.print("%   Non-snoring: ");
    Serial.print(nonSnoringScore * 100.0f, 2);
    Serial.print("%   (need snore >= ");
    Serial.print(SNORE_MIN_SCORE * 100.0f, 0);
    Serial.println("% and higher than non-snore)");
    Serial.print("RMS: ");
    Serial.println(rms, 1);
    Serial.print("Peak: ");
    Serial.println(peak);
    Serial.println("================================");

    if (isSnoringWinner(snoringScore, nonSnoringScore)) {
        ledBlueSnoring();
        unsigned long now = millis();
        uint8_t streak = noteSnoreEvent(now);

        if (streak == 0xFF) {
            Serial.println(">>> SNORING ignored (pump / post-pump mute) <<<");
            Serial.println(">>> RGB LED = BLUE <<<");
        } else if (streak == 0xFE) {
            Serial.print(">>> SNORING ignored (min gap ");
            Serial.print(SNORE_MIN_GAP_MS / 1000UL);
            Serial.println("s — same long snore) <<<");
            Serial.println(">>> RGB LED = BLUE <<<");
        } else {
            uint8_t level = snoreLevelFromScore(snoringScore, rms);
            uint16_t rmsU16 = (uint16_t)constrain((int)rms, 0, 65535);
            Serial.print(">>> SNORING DETECTED  streak=");
            Serial.print(streak);
            Serial.print("/");
            Serial.print(snoreThreshold);
            Serial.print(" in ");
            Serial.print(snoreWindowSec);
            Serial.print("s  elevated=");
            Serial.print(pillowElevated ? "yes" : "no");
            Serial.println(" <<<");
            Serial.println(">>> RGB LED = BLUE <<<");

            if (pillowElevated) {
                markSnoringWhileElevated(now);
                notifyPhone(level, rmsU16, streak, false);

                // Still snoring while elevated: short top-up (pump schedules 3s valve after 1 min).
                bool sent = notifyPumpTopup(level, rmsU16, streak);
                if (sent) {
                    Serial.println(">>> ELEVATED TOP-UP 2s <<<");
                    armActuatorMute(now, (unsigned long)TOPUP_SEC * 1000UL);
                } else {
                    notifySnoreActive(level, rmsU16, streak);
                    Serial.println(">>> ELEVATED snore noted (top-up cooldown/lock) <<<");
                }
            } else {
                bool intervene = streak >= snoreThreshold;
                notifyPhone(level, rmsU16, streak, intervene);
                if (intervene) {
                    bool sent = notifyPumpFull(level, rmsU16, streak);
                    if (sent) {
                        Serial.print(">>> FULL PUMP ");
                        Serial.print(pumpSeconds);
                        Serial.println(" sec -> elevated <<<");
                        pillowElevated = true;
                        quietSinceMs = 0;
                        armPostPumpMute(now);
                    } else {
                        Serial.println(">>> PUMP NOT SENT (lock/cooldown) — keep listening <<<");
                    }
                }
            }
        }
    } else {
        // Keep rolling window; only time expiry removes older snores.
        unsigned long now = millis();
        refreshSnoreWindow(now);
        updateElevatedQuietWatch(now, false);
        ledRedNonSnoring();
        Serial.print(">>> NON-SNORING  window streak=");
        Serial.print(snoreStreak);
        Serial.print(pillowElevated ? "  elevated=yes" : "  elevated=no");
        Serial.println(" <<<");
        Serial.println(">>> RGB LED = RED <<<");
    }
    Serial.println();
}

void printBleStatus()
{
    unsigned long now = millis();
    if (now - lastBleStatusMs < 2000) return;
    lastBleStatusMs = now;

    if (!phoneConnected) {
        Serial.println("BLE: waiting for app...");
    } else if (!phoneAuthenticated) {
        Serial.println("BLE: app connected - enter PIN in app");
    } else {
        Serial.println("BLE: app paired");
    }
    Serial.flush();
}

bool startIot()
{
    if (i2sReady) return true;
    Serial.println("Starting IoT (mic + ML)...");
    if (!setupI2S()) {
        Serial.println("I2S initialization FAILED");
        setRgb(80, 0, 80);
        return false;
    }
    i2sReady = true;
    calibrateNoiseFloor();
    ledWhiteNoSound();
    printDeviceSettings();
    Serial.println("I2S OK. Make noise near the mic.");
    Serial.println("WHITE = no sound (ML off)");
    Serial.println("RED   = sound, not snoring");
    Serial.println("BLUE  = snoring");
    Serial.flush();
    return true;
}

void setup()
{
    Serial.begin(115200);
    delay(2000);
    setRgb(0, 0, 40);

    Serial.println();
    Serial.println("======================================");
    Serial.println(" HAGOKILLER");
    Serial.println("======================================");
    Serial.print("MIC_SHIFT: ");
    Serial.println(micShift);
    printDeviceSettings();
    Serial.println("Connect the phone app first.");
    Serial.println("LED flashes 2 times = Bluetooth connected, then IoT starts.");
    Serial.println();

