m1seryx/HAGOKILLER/firmware/esp32_s3_inmp441/esp32_s3_inmp441.ino
    setupEspNow();
    setupPhoneBle();
}

void loop()
{
    if (pendingConnectFlash) {
        pendingConnectFlash = false;
        Serial.println("BLE connected - flashing LED 2 times");
        Serial.flush();
        flashBluetoothConnected();
        setupEspNow();
        if (startIot()) {
            iotStarted = true;
            Serial.println("IoT started");
            Serial.flush();
        }
    }

    printBleStatus();
    if (iotStarted && phoneConnected) {
        sendMicHeartbeat();
    }

    if (pendingRecalibrate && iotStarted && i2sReady) {
        pendingRecalibrate = false;
        calibrateNoiseFloor();
        ledWhiteNoSound();
    }

    if (!iotStarted || !i2sReady || !phoneConnected) {
        delay(50);
        return;
    }

    if (!captureAudio()) {
        Serial.println("Audio capture failed");
        setRgb(80, 0, 80);
        delay(1000);
        return;
    }

    float rms = computeRms(audio_buffer, EI_SAMPLE_COUNT);
    int peak = computePeak(audio_buffer, EI_SAMPLE_COUNT);
    bool soundPresent = isHearingSound(rms, peak);

    Serial.print("RMS=");
    Serial.print(rms, 1);
    Serial.print(" Peak=");
    Serial.print(peak);
    Serial.print(" -> ");
    Serial.println(soundPresent ? "SOUND (run ML)" : "NO SOUND");

    if (!soundPresent) {
        loudStreak = 0;
        unsigned long now = millis();
        refreshSnoreWindow(now);
        updateElevatedQuietWatch(now, false);
        ledWhiteNoSound();
        delay(50);
        return;
    }

    loudStreak++;
    if (loudStreak < LOUD_STREAK_NEED) {
        Serial.println("SOUND too brief / far - wait");
        delay(50);
        return;
    }

    signal_t signal;
    signal.total_length = EI_SAMPLE_COUNT;
    signal.get_data = &get_signal_data;

    ei_impulse_result_t result = { 0 };
    EI_IMPULSE_ERROR res = run_classifier(&signal, &result, false);

    if (res != EI_IMPULSE_OK) {
        Serial.print("ERROR: run_classifier failed: ");
        Serial.println(res);
        setRgb(80, 0, 80);
        delay(1000);
        return;
    }

    printResult(result, rms, peak);
    delay(80);
}
 